let mas = [
	[16, -37, 54, -4, 72],
	[-56, 47, 4, -16, 25],
	[-37, 46, 4, -51, 27],
	[-63, 4, -54, 76, -4],
	[12, -35, 4, 47]
];

let odd = 0;
let even = 0;
let sum = 0;
let count = 0;
let min = Infinity;
let max = -Infinity;
let countMin = 0;
let countMax = 0;
let negative = 0;
let sumEven = 0;
let sumOdd = 0;
let comp = 1;
let num = 0;
let max1 = -Infinity;
let posMax;

for (i = 0; i < mas.length; i++) {
	for (j = 0; j < mas[i].length; j++) {
		if (mas[i][j] >= 0) {
			sum += mas[i][j];
			count++;
		}
	}
}

console.log('Задание 1: Сумма = ' + sum + ' ' + 'Количество элементов: ' + count);
//----------------------------------------------------------------------------------------------

for (i = 0; i < mas.length; i++) {
	for (j = 0; j < mas[i].length; j++) {

		countMin++;

		if (mas[i][j] < min) {
			min = mas[i][j];
			id = countMin;

		}
	}
}

console.log('Задание 2: Минимальный элемент : ' + min + ' ' + 'Порядковый номер: ' + id);
//-------------------------------------------------------------------------------------------------

for (i = 0; i < mas.length; i++) {
	for (j = 0; j < mas[i].length; j++) {

		countMax++;

		if (mas[i][j] > max) {
			max = mas[i][j];
			id = countMax;
		}
	}
}

console.log('Задание 3: Максимальный элемент : ' + max + ' ' + 'Порядковый номер: ' + id);
//---------------------------------------------------------------------------------------------------
for (i = 0; i < mas.length; i++) {
	for (j = 0; j < mas[i].length; j++) {

		if (mas[i][j] < 0) {
			negative++;
		}
	}
}

console.log('Задание 4: Количество отрицательных элементов: ' + negative);
//---------------------------------------------------------------------------------------------------
for (i = 0; i < mas.length; i++) {
	for (j = 0; j < mas[i].length; j++) {

		if (mas[i][j] > 0) {
			if ((mas[i][j] % 2) === 1) {
				odd++;
			}
		}
	}
}

console.log('Задание 5: Количество нечетных положительных элементов: ' + odd);
//----------------------------------------------------------------------------------------------------
for (i = 0; i < mas.length; i++) {
	for (j = 0; j < mas[i].length; j++) {
		if (mas[i][j] > 0) {
			if ((mas[i][j] % 2) === 0) {
				even++;
			}
		}
	}
}

console.log('Задание 6: Количество четных положительных элементов: ' + even);
//---------------------------------------------------------------------------------------------------
for (i = 0; i < mas.length; i++) {
	for (j = 0; j < mas[i].length; j++) {
		if (mas[i][j] > 0) {
			if ((mas[i][j] % 2) === 0) {
				sumEven += mas[i][j];
			}
		}
	}
}

console.log('Задание 7: Сумма четных положительных элементов: ' + sumEven);
//---------------------------------------------------------------------------------------------------
for (i = 0; i < mas.length; i++) {
	for (j = 0; j < mas[i].length; j++) {
		if (mas[i][j] > 0) {
			if ((mas[i][j] % 2) === 1) {
				sumOdd += mas[i][j];
			}
		}
	}
}

console.log('Задание 8: Сумма нечетных положительных элементов: ' + sumOdd);
//----------------------------------------------------------------------------------------------------

for (i = 0; i < mas.length; i++) {
	for (j = 0; j < mas[i].length; j++) {
		if (mas[i][j] > 0) {
			comp = comp * mas[i][j];
		}
	}
}

console.log('Задание 9: Произведение положительных элементов: ' + comp);
//----------------------------------------------------------------------------------------------------
for (i = 0; i < mas.length; i++) {
	for (j = 0; j < mas[i].length; j++) {
		if (mas[i][j] === 4) {
			num++;
		}
	}
}

console.log('Задание 10: Количество элементов равных 4: ' + num);
//----------------------------------------------------------------------------------------------------
for (i = 0; i < mas.length; i++) {
	for (j = 0; j < mas[i].length; j++) {
		if (mas[i][j] > max1) {
			max1 = mas[i][j];
			if (posMax !== undefined) {
				mas[posMax] = 0;
			}
			posMax = [i][j];
		} else {
			mas[i][j] = 0;
		}

	}
}
console.log(mas);